## Data Exploration

In [32]:
df_bom_gross = pd.read_csv('zippedData/bom.movie_gross.csv.gz', compression='gzip')
df_bom_gross.sort_values('domestic_gross', ascending = False)

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,936700000.0,"1,131.6",2015
3080,Black Panther,BV,700100000.0,646900000,2018
3079,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018
1873,Jurassic World,Uni.,652300000.0,"1,019.4",2015
727,Marvel's The Avengers,BV,623400000.0,895500000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,NaN,49600000,2015
2392,Finding Mr. Right 2,CL,NaN,114700000,2016
2468,Solace,LGP,NaN,22400000,2016
2595,Viral,W/Dim.,NaN,552000,2016
2825,Secret Superstar,NaN,NaN,122000000,2017

Looking atthe movie budgets data, I want to see if i can get a sense of movies with highest return on investment. I need to convert the budget columns into integers

In [25]:
df_budgets = pd.read_csv('zippedData/tn.movie_budgets.csv.gz', compression='gzip')
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [26]:
df_budgets['production_budget'] = df_budgets['production_budget'].map(lambda price: int(price.replace("$", "").replace(",", "")))
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].map(lambda price: int(price.replace("$", "").replace(",", "")))
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].map(lambda price: int(price.replace("$", "").replace(",", "")))

In [27]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null int64
domestic_gross       5782 non-null int64
worldwide_gross      5782 non-null int64
dtypes: int64(4), object(2)
memory usage: 271.2+ KB

In [29]:
df_budgets['domestic_roi'] = df_budgets['domestic_gross'] / df_budgets['production_budget']

In [30]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_roi
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,1.789430
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,0.587101
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,0.122178
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,1.388403
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,1.956408

In [33]:
df_budgets.sort_values(['domestic_roi'], ascending = False).head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_roi
5745,46,"Jun 30, 1972",Deep Throat,25000,45000000,45000000,1800.000000
5773,74,"Feb 26, 1993",El Mariachi,7000,2040920,2041928,291.560000
5492,93,"Sep 25, 2009",Paranormal Activity,450000,107918810,194183034,239.819578
5406,7,"Jul 14, 1999",The Blair Witch Project,600000,140539099,248300000,234.231832
5679,80,"Jul 10, 2015",The Gallows,100000,22764410,41656474,227.644100
5715,16,"Aug 9, 1995",The Brothers McMullen,50000,10426506,10426506,208.530120
5665,66,"Oct 18, 1974",The Texas Chainsaw Massacre,140000,26572439,26572439,189.803136
5709,10,"May 7, 2004",Super Size Me,65000,11529368,22233808,177.374892
5781,82,"Aug 5, 2005",My Date With Drew,1100,181041,181041,164.582727
5372,73,"Aug 11, 1973",American Graffiti,777000,115000000,140000000,148.005148
5536,37,"Oct 17, 1978",Halloween,325000,47000000,70000000,144.615385
5117,18,"Dec 21, 1937",Snow White and the Seven Dwarfs,1488000,184925486,184925486,124.277880
5357,58,"Jan 1, 1971",Billy Jack,800000,98000000,98000000,122.500000
5346,47,"Aug 13, 1942",Bambi,858000,102797000,268000000,119.810023
5210,11,"Nov 21, 1976",Rocky,1000000,117235147,225000000,117.235147
5746,47,"Aug 1, 1997",In the Company of Men,25000,2883661,2883661,115.346440
5742,43,"Oct 19, 1994",Clerks,27000,3073428,3894240,113.830667
5507,8,"Jun 11, 2004",Napoleon Dynamite,400000,44540956,46122713,111.352390
5676,77,"Oct 1, 1968",Night of the Living Dead,114000,12087064,30087064,106.026877
5680,81,"Sep 29, 2006",Facing the Giants,100000,10178331,10243159,101.783310

In [39]:
df_budgets['release_date'] = pd.to_datetime(df_budgets['release_date'])

In [46]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_roi
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,1.789430
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,0.587101
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,0.122178
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,1.388403
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,1.956408

In [45]:
df_budgets['release_date'][0].str([:4])

SyntaxError: invalid syntax (<ipython-input-45-7a4c0883b3fb>, line 1)